_sdaiGetEntityById(Sdai_instS*,System.Int32)
\details
Retrieves an application instance by its identifier
\param model [in] A model that owns the application instance.
\param id    [in] An entity identifier.
\returns An application instance represented by its STEP-identifier if the entity was found; otherwise, the function returns the NULL pointer.
\remarks
The functions starting from _sdai are ODA extensions over the standard.
Possible error codes:
* sdaiMO_NEXS - SDAI-model does not exist.
* sdaiEI_NEXS - Instance does not exist.
\code
SdaiInstance instanceRecord27 = _sdaiGetEntityById(pModel, 27);
...
SdaiBoolean boolRes = sdaiTestAttrBN(instanceRecord27, "UnitType");